# Setup connection to postgres server

Assume that we are running the server in on a node called `postgres` See [https://github.com/IITDBGroup/cs425](https://github.com/IITDBGroup/cs425) to see how to setup a docker container and link the notebook container to expose the postgres server as `postgres` on the notebookserver. Make sure to run this cell first to get a connection. The syntax for running SQL code from a jupyter notebook using cell magic is described [here](https://github.com/catherinedevlin/ipython-sql). **Every time you open this notebook, you have to execute the cell below to open a connection to postgres.**

In [1]:
%load_ext sql
%sql postgresql://postgres:test@notebpostgres/cs425

/opt/conda/lib/python3.6/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/opt/conda/lib/python3.6/site-packages/sql/magic.py:4: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  from IPython.utils.traitlets import Bool, Int, Unicode

'Connected: postgres@cs425'

# Basic SQL syntax, constants, and identifiers

## Keywords

Keywords in SQL are case insensitive, e.g., `SELECT`, `SeLeCT`, and `select` will all be recognized as the keyword "SELECT" in SQL. 

## Identifiers

The conventions for identifiers (e.g., table and attribute names) in SQL are dependent on the database system you are using. Typically, identifiers are case-insensitive, have to start with a letter, and can contain letters, numbers, and `_` (underscore). Postgres internally stores identifiers as lowercase, e.g., table names `STuDENt`, `student`, and `STUDENT` would all be represented internally as `student`. Using quoting, you can use identifiers that do not follow this syntax. Quoted identifiers are delimited by `"` (double quote). For example, `99people` is not a valid identifier since it starts with a number. However, `"99people"` is allowed. 

## Constants

* String constants in SQL are delimited by `'` (single quote), e.g., `'Peter'` is a valid string
* Number constants, e.g., `1`, `12432`, `-234235`
* Format of date constants is database system dependent. Most systems allow you to specify the format for a date. See [https://www.postgresql.org/docs/9.6/static/datatype-datetime.html](https://www.postgresql.org/docs/9.6/static/datatype-datetime.html) for information of how dates are handled in Postgres. For example, ` DATE '2004-10-19'` creates a date constant

## Casting

* In postgres casting is denoted by `expression::datatype`. For instance, `'123'::int` casts the string constant `'123'` as an integer

## Function Calls

* functions are called using `()`. For instance, function `upper` converts a string into upper case: `upper('abc')` would yield `'ABC'`.

# Data Definition Language (DDL)

The data definition language part of SQL allows you to change the schema of a database, e.g., creating new relations (tables) or changing the schema of a relation.

## Creating Tables

The create table statement creates a new table. It is of the form:

~~~sql
CREATE TABLE table_name (attrdefs_and_constraints);

attrdefs_and_constraints := (attrdef | constraint)*

attrdef := name datatype
constraint := PRIMARY KEY (attrname_list) | FOREIGN KEY (attrname_list) REFERENCES relation_name | ...
~~~

Let's create a table to store information about student organizations which records for each organization their `name`, `budget`, and whether its membership is restricted to persons of a particular gender (`m = male`, `f = female`, `a = all`).

In [9]:
%%sql
CREATE TABLE student_org 
(
    name TEXT,
    budget float,
    gender char(1),
    PRIMARY KEY (name)
);

Done.

[]

Now let's check out the newly generated table using a query: `SELECT * FROM table_name` returns all rows of table `table_name`. We will discuss queries in more detail later.

In [11]:
%%sql
SELECT * FROM student_org;

0 rows affected.

[]

Now let's insert some rows into our new table. We are using SQL's insert command of the form

~~~sql
INSERT INTO table_name VALUES (value_list);
~~~

and then check the updated content.

In [12]:
%%sql
INSERT INTO student_org VALUES ('ACM', 10000, 'a');
INSERT INTO student_org VALUES ('IEEE', 20000, 'a');
SELECT * FROM student_org;

1 rows affected.
1 rows affected.
2 rows affected.

[('ACM', 10000.0, 'a'), ('IEEE', 20000.0, 'a')]

## Changing the schema of a relation

SQL provides the `ALTER TABLE` command for changing the schema of a relation. Let's add a column storing the immigration status of student to the `student` relation:

In [3]:
%%sql
ALTER TABLE student ADD imm_status VARCHAR(30);

Done.

[]

Again, let's see how this affected the student relation using a query. A shown below, the database has set the value of the new column to `NULL` (shown as `None` in Python) for all students in the database.

In [5]:
%%sql
SELECT * FROM student;

13 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102'), None),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32'), None),
 ('19991', 'Brandt', 'History', Decimal('80'), None),
 ('23121', 'Chavez', 'Finance', Decimal('110'), None),
 ('44553', 'Peltier', 'Physics', Decimal('56'), None),
 ('45678', 'Levy', 'Physics', Decimal('46'), None),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54'), None),
 ('55739', 'Sanchez', 'Music', Decimal('38'), None),
 ('70557', 'Snow', 'Physics', Decimal('0'), None),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58'), None),
 ('76653', 'Aoi', 'Elec. Eng.', Decimal('60'), None),
 ('98765', 'Bourikas', 'Elec. Eng.', Decimal('98'), None),
 ('98988', 'Tanaka', 'Biology', Decimal('120'), None)]

Now let's get rid of this column.

In [6]:
%%sql
ALTER TABLE student DROP imm_status;

Done.

[]

... and check that we are back to normal.

In [7]:
%%sql
SELECT * FROM student;

13 rows affected.

[('00128', 'Zhang', 'Comp. Sci.', Decimal('102')),
 ('12345', 'Shankar', 'Comp. Sci.', Decimal('32')),
 ('19991', 'Brandt', 'History', Decimal('80')),
 ('23121', 'Chavez', 'Finance', Decimal('110')),
 ('44553', 'Peltier', 'Physics', Decimal('56')),
 ('45678', 'Levy', 'Physics', Decimal('46')),
 ('54321', 'Williams', 'Comp. Sci.', Decimal('54')),
 ('55739', 'Sanchez', 'Music', Decimal('38')),
 ('70557', 'Snow', 'Physics', Decimal('0')),
 ('76543', 'Brown', 'Comp. Sci.', Decimal('58')),
 ('76653', 'Aoi', 'Elec. Eng.', Decimal('60')),
 ('98765', 'Bourikas', 'Elec. Eng.', Decimal('98')),
 ('98988', 'Tanaka', 'Biology', Decimal('120'))]

# Run basic SQL queries

First let's run some basic queries over the **University** schema from the textbook

Get all departments (here the * * * is a shortcut referring to all attributes)

In [2]:
%%sql
SELECT * FROM department

7 rows affected.

[('Biology', 'Watson', Decimal('90000.00')),
 ('Comp. Sci.', 'Taylor', Decimal('100000.00')),
 ('Elec. Eng.', 'Taylor', Decimal('85000.00')),
 ('Finance', 'Painter', Decimal('120000.00')),
 ('History', 'Painter', Decimal('50000.00')),
 ('Music', 'Packard', Decimal('80000.00')),
 ('Physics', 'Watson', Decimal('70000.00'))]

Only show the names of departments:

In [3]:
%%sql
SELECT dept_name FROM department

7 rows affected.

[('Biology',),
 ('Comp. Sci.',),
 ('Elec. Eng.',),
 ('Finance',),
 ('History',),
 ('Music',),
 ('Physics',)]

Find all departments that at least one student is associated with. Do only return each department one (using `DISTINCT`)

In [3]:
%%sql
SELECT DISTINCT dept_name FROM student

7 rows affected.

[('Comp. Sci.',),
 ('Elec. Eng.',),
 ('History',),
 ('Music',),
 ('Finance',),
 ('Physics',),
 ('Biology',)]

# Data Manipulation Language (DML) Operations 
Now let's learn about how to update tables by inserting, deleting, and updating rows.

## Inserting data
We first take a look at how to insert data into a table using SQL's `INSERT` command. Inserting a single new row is done as follows:
~~~sql
INSERT INTO table VALUES (value1, ..., valueN)
~~~

In [3]:
%%sql
INSERT INTO department VALUES ('data science', 'Watson', 200000.0)

1 rows affected.

[]

Now let's check the new state of table `department`

In [4]:
%%sql
SELECT * FROM department

8 rows affected.

[('Biology', 'Watson', Decimal('90000.00')),
 ('Comp. Sci.', 'Taylor', Decimal('100000.00')),
 ('Elec. Eng.', 'Taylor', Decimal('85000.00')),
 ('Finance', 'Painter', Decimal('120000.00')),
 ('History', 'Painter', Decimal('50000.00')),
 ('Music', 'Packard', Decimal('80000.00')),
 ('Physics', 'Watson', Decimal('70000.00')),
 ('data science', 'Watson', Decimal('200000.00'))]